DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
void restoreResetTrustAfterRestart() {
  if (!LittleFS.begin() || !LittleFS.exists(kResetTrustHandoverPath)) {
    return;
  }
  String record;
  File file = LittleFS.open(kResetTrustHandoverPath, "r");
  if (file) {
    record = file.readString();
    file.close();
  }
  LittleFS.remove(kResetTrustHandoverPath);

  const rst_info* resetInfo = ESP.getResetInfoPtr();
  if (resetInfo == nullptr || resetInfo->reason != REASON_SOFT_RESTART) {
    return;
  }
  codexbar_display::core::ResetTrustState restored;
  if (codexbar_display::core::DecodeResetTrustRecord(
          record,
          codexbar_display::core::kResetRestartDowntimeSecs,
          millis(),
          restored)) {
    runtimeCtx.runtime.reset = restored;
  }
}

bool validAuthToken(const String& value) {
  if (value.length() < 16 || value.length() > 64) {
    return false;
  }
  for (size_t i = 0; i < value.length(); ++i) {
    const char c = value.charAt(i);
    const bool ok =
        (c >= 'a' && c <= 'z') ||
        (c >= 'A' && c <= 'Z') ||
        (c >= '0' && c <= '9') ||
        c == '-' ||
        c == '_';
    if (!ok) {
      return false;
    }
  }
  return true;
}

String generateAuthToken() {
  uint32_t seed = ESP.getCycleCount() ^ micros() ^ (static_cast<uint32_t>(ESP.getChipId()) << 8);
  randomSeed(seed);
  String token;
  token.reserve(32);
  for (uint8_t i = 0; i < 4; ++i) {
    uint32_t value = static_cast<uint32_t>(random(0x10000)) << 16;
    value |= static_cast<uint32_t>(random(0x10000));
    char chunk[9];
    snprintf(chunk, sizeof(chunk), "%08lx", static_cast<unsigned long>(value));
    token += chunk;
  }
  return token;
}

bool loadDeviceAuthToken() {
  deviceAuthToken = "";
  if (!LittleFS.begin() || !LittleFS.exists(kDeviceAuthTokenPath)) {
    return false;
  }
  File file = LittleFS.open(kDeviceAuthTokenPath, "r");
  if (!file) {
    return false;
  }
  String token = file.readString();
  file.close();
  token.trim();
  if (!validAuthToken(token)) {
    return false;
  }
  deviceAuthToken = token;
  return true;
}

bool saveDeviceAuthToken(const String& token) {
  if (!validAuthToken(token) || !LittleFS.begin()) {
    return false;
  }
  File file = LittleFS.open(kDeviceAuthTokenPath, "w");
  if (!file) {
    return false;
  }
  file.print(token);
  file.close();
  deviceAuthToken = token;
  return true;
}

bool deviceAuthConfigured() {
  return deviceAuthToken.length() > 0;
}

String requestAuthToken() {
  String token = webServer.header(kDeviceAuthHeader);
  token.trim();
  if (token.length() == 0) {
    token = webServer.arg("token");
    token.trim();
  }
  return token;
}

bool requestHasValidAuth() {
  if (!deviceAuthConfigured()) {
    return true;
  }
  return requestAuthToken() == deviceAuthToken;
}

bool requestHasCurrentDeviceToken() {
  return deviceAuthConfigured() && requestAuthToken() == deviceAuthToken;
}

bool requestHasValidOtaAuth() {
  return codexbar_display::esp8266::WifiSecurityPolicy::AllowsFirmwareUpload(
      deviceAuthConfigured(),
      requestHasCurrentDeviceToken());
}

bool authorizeWifiCredentialWrite() {
  if (codexbar_display::esp8266::WifiSecurityPolicy::AllowsCredentialWrite(
          setupMode,
          deviceAuthConfigured(),
          requestHasCurrentDeviceToken())) {
    return true;
  }
  addCorsHeaders();
  if (deviceAuthConfigured()) {
    webServer.sendHeader("WWW-Authenticate", "VibeTV token");
    webServer.send(401, "text/plain; charset=utf-8", "pairing token required");
  } else {
    webServer.send(403, "text/plain; charset=utf-8", "physical setup confirmation required");
  }
  return false;
}

bool requireWriteAuth() {
  if (requestHasValidAuth()) {
    return true;
  }
  addCorsHeaders();
  webServer.sendHeader("WWW-Authenticate", "VibeTV token");
  webServer.send(401, "text/plain; charset=utf-8", "pairing token required");
  return false;
}

void appendAuthStatusJSON(String& out) {
  out += "\"auth\":{\"paired\":";
  out += deviceAuthConfigured() ? "true" : "false";
  out += ",\"tokenHeader\":\"";
  out += kDeviceAuthHeader;
  out += "\"}";
}

void appendBrightnessCapabilityJSON(String& out) {
  if (!renderer.SupportsBrightnessControl()) {
    out += "{\"supported\":false}";
    return;
  }
  out += "{\"supported\":true,\"minPercent\":";
  out += String(kMinBrightnessPercent);
  out += ",\"maxPercent\":";
  out += String(kMaxBrightnessPercent);
  out += "}";
}

// Standby needs a second ThemeSpec slot, so a build without the ThemeSpec
// renderer cannot support it. Hosts must read this instead of assuming that a
// given firmware version implies standby support.
void appendStandbyCapabilityJSON(String& out) {
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  out += "{\"supported\":true,\"minTimeoutMinutes\":";
  out += String(standby::kMinTimeoutMinutes);
  out += ",\"maxTimeoutMinutes\":";
  out += String(standby::kMaxTimeoutMinutes);
  out += ",\"defaultTimeoutMinutes\":";
  out += String(standby::kDefaultTimeoutMinutes);
  out += ",\"screensaverSlot\":true}";
#else
  out += "{\"supported\":false}";
#endif
}

// Live standby state, kept out of the HTTP handler so the USB status channel
// (#301) can emit the same shape. It must never go into hello, which is a boot
// snapshot emitted once in setup().
void appendStandbyStateJSON(String& out) {
  out += "\"standby\":{\"active\":";
  out += standbyState.active ? "true" : "false";
  out += ",\"idleSecs\":";
  out += String((millis() - standbyState.lastActivityMs) / 1000UL);
  // While standby draws the screensaver, display.themeSpec.path is the
  // screensaver, not the live slot. A host that restores the live theme has to
  // read this instead, or it would write the screensaver into the live slot.
  out += ",\"liveThemePath\":";
  appendJSONNullableString(out, standbyLiveThemePath);
  out += "}";
}

void appendSettingsJSON(String& out) {
  out += "\"settings\":{\"display\":{\"brightnessPercent\":";
  out += String(deviceSettings.brightnessPercent);
  out += "},\"standby\":{\"enabled\":";
  out += deviceSettings.standby.enabled ? "true" : "false";
  out += ",\"timeoutMinutes\":";
  out += String(deviceSettings.standby.timeoutMinutes);
  out += ",\"brightnessPercent\":";
  out += String(deviceSettings.standby.brightnessPercent);
  out += ",\"screensaverPath\":";
  if (standby::HasScreensaver(deviceSettings.standby)) {
    out += "\"";
    out += jsonEscape(String(deviceSettings.standby.screensaverPath));
    out += "\"";
  } else {
    out += "null";
  }
  out += "}}";
}

// Clock state is a diagnostic: it must show whether the displayed time is the
// device's own, a still-current Companion string, or nothing trustworthy.
void appendClockJSON(String& out) {
  const unsigned long nowMs = millis();
  char timeText[deviceclock::kTimeTextSize];
  char dateText[deviceclock::kDateTextSize];
  const deviceclock::Source source =
      codexbar_display::app::ClockTimeText(runtimeCtx, nowMs, timeText, sizeof(timeText));
  codexbar_display::app::ClockDateText(runtimeCtx, nowMs, dateText, sizeof(dateText));

