DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
  webServer.send(200, "text/html; charset=utf-8", "<!doctype html><p>WiFi settings cleared. Vibe TV is restarting setup.</p>");
  drawWifiResetStatus("Restarting");
  waitStatusRendered = true;
  delay(500);
  clearWifiCredentials();
  clearSdkWifiCredentials();
  delay(250);
  persistResetTrustForRestart();
  ESP.restart();
}

void addCorsHeaders() {
  webServer.keepAlive(false);
  webServer.sendHeader("Access-Control-Allow-Origin", "*");
  webServer.sendHeader("Access-Control-Allow-Methods", "GET,POST,DELETE,OPTIONS");
  webServer.sendHeader("Access-Control-Allow-Headers", String("Content-Type,") + kDeviceAuthHeader);
}

void handleHello() {
  addCorsHeaders();
  if (requestAuthToken().length() > 0 && !requireWriteAuth()) {
    return;
  }

  String out;
  out.reserve(900);
  out += "{\"kind\":\"hello\",\"protocolVersion\":2,\"board\":\"";
  out += CODEXBAR_DISPLAY_BOARD_ID;
  out += "\",\"deviceId\":\"";
  out += ESP.getChipId();
  out += "\",\"networkMode\":\"";
  out += setupMode ? "setup" : "station";
  out += "\",\"firmware\":\"";
  out += CODEXBAR_DISPLAY_FW_VERSION;
  out += "\",\"maxFrameBytes\":";
  out += String(kMaxFrameBytes);
  out += ",\"capabilities\":{\"display\":{\"brightness\":";
  appendBrightnessCapabilityJSON(out);
  out += "},\"standby\":";
  appendStandbyCapabilityJSON(out);
  out += ",\"theme\":";
#ifdef CODEXBAR_DISPLAY_PROBE_ONLY
  out += themeCapabilitiesJSON(false, true);
#else
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  out += themeCapabilitiesJSON(true, true);
#else
  out += themeCapabilitiesJSON(false, true);
#endif
#endif
  out += ",";
  appendAuthStatusJSON(out);
  out += ",\"transport\":{\"active\":\"wifi\"}}}";
  webServer.send(200, "application/json", out);
}

bool isSafeAssetPath(const String& path) {
  return codexbar_display::esp8266::AssetPathPolicy::IsSafeSyntax(path.c_str(), path.length());
}

bool isMutableThemeAssetPath(const String& path) {
  return codexbar_display::esp8266::AssetPathPolicy::IsMutableThemeAsset(path.c_str(), path.length());
}

bool ensureAssetParentDirs(const String& path) {
  int slash = path.indexOf('/', 1);
  while (slash > 0) {
    const String dir = path.substring(0, slash);
    if (dir.length() > 1 && !LittleFS.exists(dir)) {
      if (!LittleFS.mkdir(dir)) {
        return false;
      }
    }
    slash = path.indexOf('/', slash + 1);
  }
  return true;
}

bool filesystemInfoJSON(String& out) {
  const bool mounted = LittleFS.begin();

  out += "\"filesystem\":{\"mounted\":";
  out += mounted ? "true" : "false";
  out += "}";
  return mounted;
}

String normalizedAssetListPath(const String& dirPath, const String& fileName) {
  if (fileName.startsWith("/")) {
    if (dirPath.length() > 1 && !fileName.startsWith(dirPath + "/")) {
      return dirPath + fileName;
    }
    return fileName;
  }
  if (dirPath.length() > 1) {
    return dirPath + "/" + fileName;
  }
  return "/" + fileName;
}

void appendAssetEntriesJSON(String& out, const String& dirPath, bool& first, String& seen, uint8_t depth) {
  if (depth > 4) {
    return;
  }
  Dir dir = LittleFS.openDir(dirPath);
  while (dir.next()) {
    const String path = normalizedAssetListPath(dirPath, dir.fileName());
    if (dir.isDirectory()) {
      appendAssetEntriesJSON(out, path, first, seen, depth + 1);
      continue;
    }
    if (!isMutableThemeAssetPath(path)) {
      continue;
    }
    const String seenToken = "|" + path + "|";
    if (seen.indexOf(seenToken) >= 0) {
      continue;
    }
    seen += seenToken;
    if (!first) {
      out += ",";
    }
    first = false;
    out += "{\"path\":\"";
    out += jsonEscape(path);
    out += "\",\"sizeBytes\":";
    out += String(dir.fileSize());
    out += "}";
  }
}

void appendAssetListJSON(String& out) {
  out += "\"assets\":[";
  bool first = true;
  if (LittleFS.begin()) {
    String seen;
    appendAssetEntriesJSON(out, "/", first, seen, 0);
    appendAssetEntriesJSON(out, "/themes", first, seen, 0);
    appendAssetEntriesJSON(out, "/themes/u", first, seen, 0);
    appendAssetEntriesJSON(out, "/themes/mini", first, seen, 0);
  }
  out += "]";
}

// Diagnostics for the reset countdown. There is no wall clock, so "last fresh"
// is reported as the age of the basis instead of a timestamp.
void appendResetTrustJSON(String& out) {
  namespace core = codexbar_display::core;
  const core::ResetTrustState& state = runtimeCtx.runtime.reset;
  const unsigned long now = millis();
  out += F("\"reset\":{\"trust\":\"");
  out += core::ResetTrustName(core::CurrentResetTrust(state, now));
  out += F("\",\"deadlineSecs\":");
  out += String(static_cast<long>(core::CurrentRemainingSecs(runtimeCtx.runtime, now)));
  out += F(",\"trustSecs\":");
  out += String(static_cast<long>(core::ResetTrustBudgetSecs(state, now)));
  out += F(",\"basisAgeSecs\":");
  out += String(static_cast<long>(core::ResetBasisAgeSecs(state, now)));
  out += F(",\"source\":");
  appendJSONNullableString(out, state.source);
  out += F("},");
}

void handleHealth() {
  const codexbar_display::esp8266::RendererHealthSnapshot snapshot = renderer.HealthSnapshot();

  String out;
  // Sized for the full payload: #280 added the clock block, #279 the reset
  // trust block and #284 the standby state, and growing this String mid-build
  // fragments a tight heap.
  out.reserve(1344);
  out += "{\"ok\":true,\"firmware\":\"";
  out += jsonEscape(CODEXBAR_DISPLAY_FW_VERSION);
  out += "\",\"system\":{\"freeHeap\":";
  out += String(ESP.getFreeHeap());
  out += ",\"maxFreeBlock\":";
  out += String(ESP.getMaxFreeBlockSize());
  out += ",\"heapFragmentationPercent\":";
  out += String(ESP.getHeapFragmentation());
  out += ",\"bootId\":\"";
  out += jsonEscape(bootID);
  out += "\",\"uptimeMs\":";
  out += String(millis());
  out += ",\"resetCount\":";
  out += String(bootResetCounter);
  out += ",\"resetReason\":";
  out += bootResetReasonJSON;
  out += "},";
  const bool filesystemMounted = filesystemInfoJSON(out);
  out += ",\"display\":{\"activeTheme\":\"";
  out += jsonEscape(snapshot.activeTheme);
  out += "\",\"themeSpec\":{\"active\":";
  out += snapshot.themeSpecActive ? "true" : "false";
  out += ",\"path\":";
  appendJSONNullableString(out, activeThemeSpecPath);
  out += ",\"hash\":";
  appendJSONNullableString(out, activeThemeSpecHash);
  out += ",\"renderOk\":";
  out += snapshot.themeSpecRenderOk ? "true" : "false";
  out += ",\"renderError\":";
  appendJSONNullableString(out, snapshot.themeSpecRenderError);
  out += ",\"renderFailures\":";
  out += String(snapshot.themeSpecRenderFailures);
  out += ",\"cbaCompletedFrames\":";
  out += String(snapshot.cbaCompletedFrames);
  out += ",\"cbaLastFrameDurationMs\":";
  out += String(snapshot.cbaLastFrameDurationMs);
  out += ",\"cbaBufferBytes\":";
  out += String(snapshot.cbaBufferBytes);
  out += ",\"cbaBufferAllocationFailures\":";
  out += String(snapshot.cbaBufferAllocationFailures);
  out += ",\"cbaLastPushDurationUs\":";
  out += String(snapshot.cbaLastPushDurationUs);
  out += "},\"gif\":{\"activePath\":\"";
  out += jsonEscape(snapshot.gifActivePath);
  out += "\",\"filePresent\":";
  out += snapshot.gifFilePresent ? "true" : "false";
  out += ",\"decoderAllocated\":";
  out += snapshot.gifDecoderAllocated ? "true" : "false";
  out += ",\"decoderOpen\":";
  out += snapshot.gifDecoderOpen ? "true" : "false";
  out += ",\"lastError\":";
  appendJSONNullableString(out, snapshot.gifLastErrorStage);
  out += "}},\"render\":{\"fullCount\":";
  out += String(renderDiagnostics.fullCount);
  out += ",\"partialCount\":";
  out += String(renderDiagnostics.partialCount);
  out += ",\"lastKind\":\"";
  out += jsonEscape(renderDiagnostics.lastKind);
  out += "\"},";
  appendClockJSON(out);
  appendResetTrustJSON(out);
  appendStandbyStateJSON(out);
  out += ",";
  appendSettingsJSON(out);
  out += "}";

  (void)filesystemMounted;
  addCorsHeaders();
  webServer.send(200, "application/json", out);
}

// Records which stored ThemeSpec the screensaver slot points at. Loading it
// into the second render slot is the standby state machine's job; this only
// validates and stores the reference. An empty path clears the selection.
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
bool readValidatedStoredThemeSpec(
    const String& path,
    String& raw,
    String& themeId,
    int& themeRev,
    String& error);
#endif

bool setStandbyScreensaverPath(standby::Settings& target, const String& rawPath, String& error) {
  String path = rawPath;
  path.trim();
  if (path.length() == 0) {
    standby::ClearScreensaverPath(target);
    return true;
  }
  if (!isSafeAssetPath(path) ||
      !standby::ScreensaverPathValid(path.c_str(), path.length())) {
    error = "invalid screensaver path";
    return false;
  }
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  String raw;
  String themeId;
  int themeRev = 0;
  if (!readValidatedStoredThemeSpec(path, raw, themeId, themeRev, error)) {
    if (error == "theme file not found") {
      error = "screensaver file not found";
    }
    return false;
  }
#else
  if (!LittleFS.begin()) {
    error = "filesystem mount failed";
    return false;
  }
  if (!LittleFS.exists(path)) {
    error = "screensaver file not found";
    return false;
  }
#endif
  if (!standby::SetScreensaverPath(target, path.c_str(), path.length())) {
    error = "invalid screensaver path";
    return false;
  }
  return true;
}

bool persistDeviceSettings(const DeviceSettings& next) {
  const DeviceSettings previous = deviceSettings;
  deviceSettings = next;
  if (!saveDeviceSettings()) {
    deviceSettings = previous;
    applyDeviceSettings();
    return false;
  }
  applyDeviceSettings();
  return true;
}

void handleSettingsAPI() {
  addCorsHeaders();
  if (!requireWriteAuth()) {
    return;
  }
  DeviceSettings next = deviceSettings;
  const bool apiResponse = webServer.hasArg("api");
  bool changed = false;
  if (webServer.hasArg("b")) {
    next.brightnessPercent = clampBrightnessPercent(webServer.arg("b").toInt());
    changed = true;
  }
  if (webServer.hasArg("sb")) {
    next.standby.enabled = webServer.arg("sb").toInt() != 0;
    changed = true;
  }
  if (webServer.hasArg("st")) {
    next.standby.timeoutMinutes = standby::ClampTimeoutMinutes(webServer.arg("st").toInt());
    changed = true;
  }
  if (webServer.hasArg("sbr")) {
    next.standby.brightnessPercent =
        standby::ClampBrightnessPercent(webServer.arg("sbr").toInt());
    changed = true;
  }
  if (webServer.hasArg("ss")) {
    String error;
    if (!setStandbyScreensaverPath(next.standby, webServer.arg("ss"), error)) {
      webServer.send(400, "text/plain; charset=utf-8", error);
      return;
    }
    changed = true;
  }
  if (!changed) {
    webServer.send(400, "text/plain; charset=utf-8", "bad");
    return;
  }
  if (!persistDeviceSettings(next)) {
    webServer.send(500, "text/plain; charset=utf-8", "save failed");
    return;
  }
  if (!apiResponse && webServer.hasArg("b")) {
    webServer.sendHeader("Location", "/");
    webServer.send(303);
    return;
  }
  String out;
  out.reserve(80);
  out += "{\"ok\":true,";
  appendSettingsJSON(out);
  out += "}";
  webServer.send(200, "application/json", out);
}

void handlePairingAPI() {
  addCorsHeaders();
  const String token = generateAuthToken();
  if (!saveDeviceAuthToken(token)) {
    webServer.send(500, "text/plain; charset=utf-8", "pairing token save failed");
    return;
  }
  if (webServer.hasArg("api")) {
    String out;
    out.reserve(100);
    out += "{\"ok\":true,\"token\":\"";
    out += jsonEscape(token);
    out += "\"}";
    webServer.send(200, "application/json", out);
    return;
  }
  webServer.sendHeader("Location", "/");
  webServer.send(303);
}

void handleAssetsList() {
  String out;
  out.reserve(1200);
  out += "{";
  (void)filesystemInfoJSON(out);
  out += ",";
  appendAssetListJSON(out);
  out += "}";
  addCorsHeaders();
  webServer.send(200, "application/json", out);
}

void setAssetUploadError(const String& message) {
  if (assetUploadFile) {
    assetUploadFile.close();
  }
  if (assetUploadError.length() > 0) {
    return;
  }
  assetUploadError = message;
  Serial.printf("asset_upload_error path=%s message=%s\n", assetUploadPath.c_str(), assetUploadError.c_str());
}

void finishAssetUploadRequest() {
  if (assetUploadFile) {
    assetUploadFile.close();
  }
  assetUploadInProgress = false;
}

