DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
bool readStoredThemeSpec(const String& path, String& raw, String& error) {
  if (!isSafeAssetPath(path) || !path.startsWith("/themes/")) {
    error = "invalid theme path";
    return false;
  }
  if (!LittleFS.begin()) {
    error = "filesystem mount failed";
    return false;
  }
  if (!LittleFS.exists(path)) {
    error = "theme file not found";
    return false;
  }

  File file = LittleFS.open(path, "r");
  if (!file) {
    error = "open theme file failed";
    return false;
  }
  const size_t size = file.size();
  if (size == 0 || size > kMaxStoredThemeSpecBytes) {
    file.close();
    error = "theme file too large";
    return false;
  }
  raw = file.readString();
  file.close();
  raw.trim();

  // Devices upgraded from 1.0.36 can still have this explicitly active Mini
  // spec. Keep its label compatibility without treating it as a boot fallback.
  if (path == kLegacyMiniThemeSpecPath) {
    raw.replace("\"v\":\"left\"", "\"v\":\"{usageMode}\"");
  }
  if (raw.length() == 0 || raw.length() > kMaxStoredThemeSpecBytes) {
    error = "theme file too large";
    return false;
  }
  return true;
}

bool themeSpecMetadata(const String& raw, String& themeId, int& themeRev, String& error) {
  JsonDocument filter;
  filter["themeId"] = true;
  filter["id"] = true;
  filter["themeRev"] = true;
  filter["rev"] = true;

  JsonDocument doc;
  const DeserializationError err = deserializeJson(doc, raw, DeserializationOption::Filter(filter));
  if (err) {
    error = String("bad theme json: ") + err.c_str();
    return false;
  }
  JsonObjectConst spec = doc.as<JsonObjectConst>();
  if (spec.isNull()) {
    error = "theme json must be an object";
    return false;
  }

  const char* id = nullptr;
  if (spec["themeId"].is<const char*>()) {
    id = spec["themeId"].as<const char*>();
  } else if (spec["id"].is<const char*>()) {
    id = spec["id"].as<const char*>();
  }
  if (id != nullptr) {
    themeId = String(id);
    themeId.trim();
  }
  themeRev = static_cast<int>(spec["themeRev"] | spec["rev"] | 0);
  if (themeId.length() == 0 || themeRev <= 0) {
    error = "theme id/rev missing";
    return false;
  }

  return true;
}

bool readValidatedStoredThemeSpec(
    const String& path,
    String& raw,
    String& themeId,
    int& themeRev,
    String& error) {
  if (!readStoredThemeSpec(path, raw, error)) {
    return false;
  }
  if (!themeSpecMetadata(raw, themeId, themeRev, error)) {
    return false;
  }
  JsonDocument doc;
  codexbar_display::themespec::CompiledThemeSpec scene;
  const bool renderable = codexbar_display::themespec::CompileThemeSpec(raw.c_str(), doc, scene);
  codexbar_display::themespec::ReleaseCompiledThemeSpec(scene);
  if (!renderable) {
    error = "theme spec has no renderable content";
    return false;
  }
  return true;
}

void activateStoredThemeSpec(const String& path, const String& raw, const String& themeId, int themeRev) {
  codexbar_display::core::SerialConsumeEvent event;
  if (!codexbar_display::core::RestoreStoredThemeSpecFrame(
          runtimeCtx.runtime, themeId, themeRev, raw, millis(), event)) {
    return;
  }
  renderer.ResetGifStateForAssetUpdate();
  activeThemeSpecPath = path;
  activeThemeSpecHash = hashHex8(raw);
  markFrameAccepted(event, "theme");
}

// `persist` is false for standby transitions: the customer's live theme choice
// must survive the screensaver, and a flash write per transition would be wear
// for nothing.
bool activateStoredThemePath(
    const String& path, bool persist, String& themeId, int& themeRev, String& error) {
  String raw;
  if (!readValidatedStoredThemeSpec(path, raw, themeId, themeRev, error)) {
    return false;
  }
  if (persist && !saveActiveThemeSpecPath(path)) {
    error = "save active theme failed";
    return false;
  }

  activateStoredThemeSpec(path, raw, themeId, themeRev);
  return true;
}

bool renderStoredThemeSpecForStandby(const String& path) {
  String themeId;
  int themeRev = 0;
  String error;
  if (activateStoredThemePath(path, false, themeId, themeRev, error)) {
    return true;
  }
  Serial.printf("standby_load_failed path=%s err=%s\n", path.c_str(), error.c_str());
  return false;
}

#endif

void handleThemeActive() {
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  if (!requireWriteAuth()) {
    return;
  }
  const bool formMode = webServer.hasArg("path");
  String path = webServer.arg("path");
  if (!formMode) {
    String body = webServer.arg("plain");
    body.trim();
    if (body.length() == 0 || body.length() > 160) {
      addCorsHeaders();
      webServer.send(400, "text/plain; charset=utf-8", "invalid theme activation body");
      return;
    }

    JsonDocument doc;
    const DeserializationError err = deserializeJson(doc, body);
    if (err) {
      addCorsHeaders();
      webServer.send(400, "text/plain; charset=utf-8", "bad theme activation json");
      return;
    }
    path = String(doc["path"] | "");
  }
  path.trim();

  String themeId;
  int themeRev = 0;
  String error;
  if (!activateStoredThemePath(path, true, themeId, themeRev, error)) {
    addCorsHeaders();
    webServer.send(error == "theme file not found" ? 404 : 400, "text/plain; charset=utf-8", error);
    return;
  }
  // The customer just picked the live theme, so it is now the screen standby
  // has to hand back — and standby ends here rather than dimming that choice.
  standbyLiveThemePath = "";
  standbyState.active = false;
  standby::NoteUsageActivity(standbyState, millis());
  applyDeviceSettings();

  if (formMode) {
    webServer.keepAlive(false);
    webServer.sendHeader("Location", "/");
    webServer.send(303);
    return;
  }

  String out;
  out.reserve(160);
  out += "{\"ok\":true,\"path\":\"";
  out += jsonEscape(path);
  out += "\",\"id\":\"";
  out += jsonEscape(themeId);
  out += "\",\"rev\":";
  out += String(themeRev);
  out += ",\"hash\":\"";
  out += jsonEscape(activeThemeSpecHash);
  out += "\"";
  out += "}";
  addCorsHeaders();
  webServer.send(200, "application/json", out);
#else
  addCorsHeaders();
  webServer.send(501, "text/plain; charset=utf-8", "theme spec renderer disabled");
#endif
}

// Selects which stored ThemeSpec the screensaver slot points at. Mirrors the
// /theme/active contract but touches a different, independent slot: it never
// changes the live theme and never renders anything. Standby rendering is the
// state machine's job.
void handleScreensaverActive() {
#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
  addCorsHeaders();
  if (!requireWriteAuth()) {
    return;
  }
  String body = webServer.arg("plain");
  body.trim();
  if (body.length() == 0 || body.length() > 160) {
    webServer.send(400, "text/plain; charset=utf-8", "invalid screensaver activation body");
    return;
  }

  JsonDocument doc;
  const DeserializationError err = deserializeJson(doc, body);
  if (err) {
    webServer.send(400, "text/plain; charset=utf-8", "bad screensaver activation json");
    return;
  }
  String path = String(doc["path"] | "");
  path.trim();

  DeviceSettings next = deviceSettings;
  String error;
  if (!setStandbyScreensaverPath(next.standby, path, error)) {
    webServer.send(error == "screensaver file not found" ? 404 : 400,
                   "text/plain; charset=utf-8", error);
    return;
  }
  if (!persistDeviceSettings(next)) {
    webServer.send(500, "text/plain; charset=utf-8", "save failed");
    return;
  }

  String out;
  out.reserve(120);
  out += "{\"ok\":true,\"path\":";
  if (standby::HasScreensaver(deviceSettings.standby)) {
    out += "\"";
    out += jsonEscape(String(deviceSettings.standby.screensaverPath));
    out += "\"";
  } else {
    out += "null";
  }
  out += "}";
  webServer.send(200, "application/json", out);
#else
  addCorsHeaders();
  webServer.send(501, "text/plain; charset=utf-8", "theme spec renderer disabled");
#endif
}

#if CODEXBAR_DISPLAY_THEME_SPEC_RENDERER
bool loadStoredThemeSpecCacheFromPath(const String& path) {
  String error;
  String raw;
  if (!readStoredThemeSpec(path, raw, error)) {
    Serial.printf("theme_cache_load_failed path=%s err=%s\n", path.c_str(), error.c_str());
    return false;
  }

