DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
  if (upload.status == UPLOAD_FILE_START) {
    if (assetUploadInProgress || otaUploadInProgress || rebootPending) {
      otaUploadSucceeded = false;
      otaUploadInProgress = true;
      otaUploadNeedsReboot = false;
      otaUploadError = "another upload is active";
      return;
    }
    otaUploadSucceeded = false;
    otaUploadInProgress = true;
    otaUploadNeedsReboot = false;
    otaUploadError = "";
    const size_t maxSize = otaMaxSizeForCommand(command);
    Serial.printf(
        "ota_upload_start target=%s filename=%s content_length=%zu max_size=%zu free_sketch_space=%zu\n",
        target,
        upload.filename.c_str(),
        upload.contentLength,
        maxSize,
        ESP.getFreeSketchSpace());
    if (!requestHasValidOtaAuth()) {
      setOtaError("unauthorized");
      return;
    }
    enterOtaSafeMode(command, &webServer.client());
    otaUploadNeedsReboot = true;
    const String targetLabel = command == U_FS ? "Loading display" : "Loading firmware";
    drawUpdateStatus(targetLabel);
    waitStatusRendered = true;
    if (!Update.begin(maxSize, command)) {
      setOtaError(Update.getErrorString());
      resetOtaUpdaterAfterFailure();
    }
  } else if (upload.status == UPLOAD_FILE_WRITE) {
    if (otaUploadError.length() == 0 && Update.write(upload.buf, upload.currentSize) != upload.currentSize) {
      setOtaError(Update.getErrorString());
      resetOtaUpdaterAfterFailure();
    }
    ESP.wdtFeed();
  } else if (upload.status == UPLOAD_FILE_END) {
    if (otaUploadError.length() == 0 && Update.end(true)) {
      otaUploadSucceeded = true;
      Serial.printf("ota_upload_success target=%s bytes=%zu\n", target, upload.totalSize);
    } else if (otaUploadError.length() == 0) {
      setOtaError(Update.getErrorString());
      resetOtaUpdaterAfterFailure();
    }
  } else if (upload.status == UPLOAD_FILE_ABORTED) {
    setOtaError("upload aborted");
    resetOtaUpdaterAfterFailure();
    Serial.printf("ota_upload_aborted target=%s bytes=%zu\n", target, upload.totalSize);
  }
  yield();
}

void scheduleReboot(const char* reason) {
  rebootPending = true;
  rebootAtMs = millis() + kRebootDelayMs;
  Serial.printf("reboot_scheduled reason=%s delay_ms=%lu\n", reason, kRebootDelayMs);
}

void handleOtaResult(const char* target) {
  webServer.keepAlive(false);
  if (otaUploadError == "unauthorized") {
    otaUploadInProgress = false;
    otaUploadNeedsReboot = false;
    addCorsHeaders();
    webServer.sendHeader("WWW-Authenticate", "VibeTV token");
    webServer.send(401, "text/plain; charset=utf-8", "pairing token required");
    return;
  }
  if (!otaUploadSucceeded || otaUploadError.length() > 0 || Update.hasError()) {
    otaUploadInProgress = false;
    const String error = otaUploadError.length() > 0 ? otaUploadError : Update.getErrorString();
    Serial.printf("ota_upload_failed target=%s error=%s\n", target, error.c_str());
    webServer.send(500, "text/plain; charset=utf-8", "Update failed: " + error);
    if (otaUploadNeedsReboot) {
      scheduleReboot("ota_failure");
    }
    otaUploadNeedsReboot = false;
    return;
  }

  String html;
  html.reserve(500);
  html += "<!doctype html><html><head><meta name='viewport' content='width=device-width,initial-scale=1'>";
  html += "<title>VibeTV Update</title></head><body style='font-family:-apple-system,BlinkMacSystemFont,Segoe UI,sans-serif;margin:32px'>";
  html += "<h1>Update successful</h1><p>";
  html += target;
  html += " was written. Vibe TV is restarting.</p></body></html>";
  webServer.send(200, "text/html; charset=utf-8", html);
  drawUpdateStatus("Restarting");
  waitStatusRendered = true;
  scheduleReboot(target);
  otaUploadInProgress = false;
  otaUploadNeedsReboot = false;
}

void sendRawOtaResponse(WiFiClient& client, int status, const char* statusText, const String& body) {
  client.print("HTTP/1.1 ");
  client.print(status);
  client.print(" ");
  client.print(statusText);
  client.print("\r\nConnection: close\r\nContent-Type: text/plain; charset=utf-8\r\nContent-Length: ");
  client.print(body.length());
  client.print("\r\n\r\n");
  client.print(body);
}

bool rawRequestLineIsFirmwarePost(const String& line) {
  return line.startsWith("POST /update/firmware.raw ") ||
         line.startsWith("POST /update/firmware.raw?") ||
         line.startsWith("PUT /update/firmware.raw ") ||
         line.startsWith("PUT /update/firmware.raw?");
}

String rawRequestToken(const String& line) {
  const int queryStart = line.indexOf("?token=");
  if (queryStart < 0) {
    return "";
  }
  int tokenStart = queryStart + 7;
  int tokenEnd = line.indexOf(' ', tokenStart);
  const int nextParam = line.indexOf('&', tokenStart);
  if (nextParam >= 0 && (tokenEnd < 0 || nextParam < tokenEnd)) {
    tokenEnd = nextParam;
  }
  if (tokenEnd < 0) {
    tokenEnd = line.length();
  }
  String token = line.substring(tokenStart, tokenEnd);
  token.trim();
  return token;
}

void handleRawOtaClient() {
  if (!rawOtaServerStarted || otaUploadInProgress || assetUploadInProgress || rebootPending) {
    return;
  }

  WiFiClient client = rawOtaServer.accept();
  if (!client) {
    return;
  }
  client.setTimeout(5000);

  String requestLine = client.readStringUntil('\n');
  requestLine.trim();
  if (!rawRequestLineIsFirmwarePost(requestLine)) {
    sendRawOtaResponse(client, 404, "Not Found", "not found");
    client.stop();
    return;
  }

  String rawToken = rawRequestToken(requestLine);
  size_t contentLength = 0;
  while (client.connected()) {
    String header = client.readStringUntil('\n');
    header.trim();
    if (header.length() == 0) {
      break;
    }
    String lower = header;
    lower.toLowerCase();
    if (lower.startsWith("content-length:")) {
      String value = header.substring(header.indexOf(':') + 1);
      value.trim();
      contentLength = static_cast<size_t>(value.toInt());
    } else if (lower.startsWith("x-vibetv-token:")) {
      rawToken = header.substring(header.indexOf(':') + 1);
      rawToken.trim();
    }
  }

  if (!codexbar_display::esp8266::WifiSecurityPolicy::AllowsFirmwareUpload(
          deviceAuthConfigured(),
          rawToken == deviceAuthToken)) {
    sendRawOtaResponse(client, 401, "Unauthorized", "pairing token required");
    client.stop();
    return;
  }

  if (contentLength == 0) {
    sendRawOtaResponse(client, 411, "Length Required", "content-length required");
    client.stop();
    return;
  }

  const size_t maxSize = otaMaxSizeForCommand(U_FLASH);
  if (contentLength > maxSize) {
    sendRawOtaResponse(client, 413, "Payload Too Large", "firmware image is too large");
    client.stop();
    return;
  }

