DreamyTalesPAN/CodexBar-Display/firmware_esp8266/src/main.cpp
  otaUploadSucceeded = false;
  otaUploadInProgress = true;
  otaUploadNeedsReboot = false;
  otaUploadError = "";

  enterOtaSafeMode(U_FLASH, &client);
  otaUploadNeedsReboot = true;
  drawUpdateStatus("Loading firmware");
  waitStatusRendered = true;

  if (!Update.begin(contentLength, U_FLASH)) {
    setOtaError(Update.getErrorString());
    resetOtaUpdaterAfterFailure();
  }

  uint8_t buffer[kRawOtaReadBufferBytes];
  size_t remaining = contentLength;
  unsigned long lastProgressMs = millis();
  while (remaining > 0 && otaUploadError.length() == 0) {
    const int available = client.available();
    if (available <= 0) {
      if (!client.connected()) {
        setOtaError("raw upload disconnected");
        resetOtaUpdaterAfterFailure();
        break;
      }
      if (millis() - lastProgressMs > kRawOtaProgressTimeoutMs) {
        setOtaError("raw upload timeout");
        resetOtaUpdaterAfterFailure();
        break;
      }
      delay(1);
      continue;
    }
    size_t want = static_cast<size_t>(available);
    if (want > remaining) {
      want = remaining;
    }
    if (want > sizeof(buffer)) {
      want = sizeof(buffer);
    }
    const int readCount = client.read(buffer, want);
    if (readCount <= 0) {
      delay(1);
      continue;
    }
    const size_t got = static_cast<size_t>(readCount);
    lastProgressMs = millis();
    remaining -= got;
    if (Update.write(buffer, got) != got) {
      setOtaError(Update.getErrorString());
      resetOtaUpdaterAfterFailure();
      break;
    }
    ESP.wdtFeed();
    delay(0);
  }

  if (otaUploadError.length() == 0 && remaining == 0 && Update.end(false)) {
    otaUploadSucceeded = true;
    sendRawOtaResponse(client, 200, "OK", "ok");
    drawUpdateStatus("Restarting");
    waitStatusRendered = true;
    scheduleReboot("firmware_raw");
    otaUploadNeedsReboot = false;
  } else {
    if (otaUploadError.length() == 0) {
      setOtaError(Update.getErrorString());
      resetOtaUpdaterAfterFailure();
    }
    sendRawOtaResponse(client, 500, "Internal Server Error", "Update failed: " + otaUploadError);
    if (otaUploadNeedsReboot) {
      scheduleReboot("firmware_raw_failure");
    }
    otaUploadNeedsReboot = false;
  }
  otaUploadInProgress = false;
  client.stop();
}

void handleFrame() {
  if (!requireWriteAuth()) {
    return;
  }
  String rawBody = webServer.arg("plain");
  if (rawBody.length() == 0) {
    addCorsHeaders();
    webServer.send(400, "text/plain; charset=utf-8", "empty frame body");
    return;
  }
  if (rawBody.length() > kMaxFrameBytes) {
    addCorsHeaders();
    webServer.send(413, "text/plain; charset=utf-8", "frame body too large");
    return;
  }
  String body = rawBody;
  body.trim();
  if (body.length() == 0) {
    addCorsHeaders();
    webServer.send(400, "text/plain; charset=utf-8", "empty frame body");
    return;
  }
  if (body.indexOf('\n') >= 0 || body.indexOf('\r') >= 0) {
    addCorsHeaders();
    webServer.send(400, "text/plain; charset=utf-8", "expected one newline-delimited JSON frame");
    return;
  }

  codexbar_display::core::SerialConsumeEvent event;
  if (!codexbar_display::core::ConsumeFrameLine(runtimeCtx.runtime, body.c_str(), millis(), event) ||
      !event.frameAccepted) {
    addCorsHeaders();
    webServer.send(400, "text/plain; charset=utf-8", "frame was not accepted");
    return;
  }

  // Acknowledge before display work so a slow render cannot make the host retry
  // an already accepted frame.
  addCorsHeaders();
  webServer.send(200, "text/plain; charset=utf-8", "ok");
  markFrameAccepted(event, "wifi");
}

void startHttpServer() {
  if (httpServerStarted) {
    return;
  }
  webServer.on("/", HTTP_GET, handleRoot);
  webServer.on("/hotspot-detect.html", HTTP_GET, handleCaptivePortalProbe);
  webServer.on("/generate_204", HTTP_GET, handleCaptivePortalProbe);
  webServer.on("/gen_204", HTTP_GET, handleCaptivePortalProbe);
  webServer.on("/fwlink", HTTP_GET, handleCaptivePortalProbe);
  webServer.on("/connecttest.txt", HTTP_GET, handleCaptivePortalProbe);
  webServer.on("/ncsi.txt", HTTP_GET, handleCaptivePortalProbe);
  webServer.on("/save", HTTP_POST, handleSaveWifi);
  webServer.on("/scan", HTTP_POST, handleSetupWifiScan);
  webServer.on("/reset-wifi", HTTP_POST, handleResetWifi);
  webServer.on("/hello", HTTP_GET, handleHello);
  webServer.on("/health", HTTP_GET, handleHealth);
  webServer.on("/api/settings", HTTP_POST, handleSettingsAPI);
  webServer.on("/api/pair", HTTP_POST, handlePairingAPI);
  webServer.on("/assets", HTTP_GET, handleAssetsList);
  webServer.on(
      "/assets",
      HTTP_POST,
      handleAssetUploadResult,
      handleAssetUpload);
  webServer.on("/assets", HTTP_DELETE, handleAssetDelete);
  webServer.on("/theme/active", HTTP_POST, handleThemeActive);
  webServer.on("/screensaver/active", HTTP_POST, handleScreensaverActive);
  webServer.on("/frame", HTTP_POST, handleFrame);
  webServer.on("/update", HTTP_GET, handleUpdatePage);
  webServer.on(
      "/update/firmware",
      HTTP_POST,
      []() {
        handleOtaResult("firmware");
      },
      []() {
        handleOtaUpload(U_FLASH, "firmware");
      });
  webServer.on(
      "/update/filesystem",
      HTTP_POST,
      []() {
        handleOtaResult("filesystem");
      },
      []() {
        handleOtaUpload(U_FS, "filesystem");
      });
  webServer.onNotFound([]() {
    if (webServer.method() == HTTP_OPTIONS) {
      addCorsHeaders();
      webServer.send(204, "text/plain", "");
      return;
    }
    if (setupMode) {
      handleCaptivePortalProbe();
      return;
    }
    webServer.send(404, "text/plain; charset=utf-8", "not found");
  });
  webServer.collectHeaders(kDeviceAuthHeader);
  webServer.begin();
  httpServerStarted = true;
  rawOtaServer.begin();
  rawOtaServer.setNoDelay(true);
  rawOtaServerStarted = true;
  Serial.println("http_server_started port=80");
  Serial.println("raw_ota_server_started port=8081 path=/update/firmware.raw");
}

void startSetupAccessPoint() {
  setupMode = true;
  pendingHttpRender = false;
  resetWifiReconnectState();
  codexbar_display::esp8266::wifi_recovery::EnterSetup(
      wifiSetupRecoveryState,
      static_cast<uint32_t>(millis()));
  codexbar_display::esp8266::wifi_setup::ResetPortalState(setupWifiState);
  WiFi.setAutoReconnect(false);
  WiFi.disconnect(false);
  WiFi.mode(WIFI_AP_STA);
  WiFi.softAP(kSetupApSsid);
  Serial.printf("wifi_setup_ap ssid=VibeTV-Setup ip=%s\n", WiFi.softAPIP().toString().c_str());
  dnsServer.start(kDnsPort, "*", WiFi.softAPIP());
  captiveDnsStarted = true;
  Serial.printf("captive_dns_started port=%u ip=%s\n", kDnsPort, WiFi.softAPIP().toString().c_str());
  startHttpServer();
  const unsigned long renderStartUs = micros();
  renderer.DrawSetupInstructions(runtimeCtx, kSetupApSsid, WiFi.softAPIP().toString());
  recordRenderFull("setup", micros() - renderStartUs);
  waitStatusRendered = true;
}

void maintainWifiConnection() {
  if (setupMode) {
    maintainWifiSetupRecovery();
    return;
  }
  if (rebootPending) {
    return;
  }
  if (WiFi.status() == WL_CONNECTED) {
    if (wifiDisconnectedAtMs != 0) {
      Serial.printf("wifi_reconnected ip=%s\n", WiFi.localIP().toString().c_str());
      drawWaitingForCompanionStatus();
    } else if (waitStatusRendered) {
      String stationIp = WiFi.localIP().toString();
      if (!codexbar_display::esp8266::ConnectedSetupPolicy::IsStationIPv4(stationIp.c_str())) {
        stationIp = "";
      }
      if (stationIp != lastConnectedSetupIp) {
        Serial.printf("wifi_station_ip_changed ip=%s\n", stationIp.c_str());
        drawWaitingForCompanionStatus();
      }
    }
    resetWifiReconnectState();
    return;
  }

  const unsigned long nowMs = millis();
  if (wifiDisconnectedAtMs == 0) {
    wifiDisconnectedAtMs = nowMs;
    wifiReconnectAttemptAtMs = 0;
    Serial.printf("wifi_disconnected status=%d fallback_ms=%lu\n",
                  static_cast<int>(WiFi.status()),
                  kWifiReconnectFallbackMs);
  }

  if (!wifiReconnectStatusRendered) {
    const unsigned long renderStartUs = micros();
    renderer.DrawStatus(runtimeCtx, "VIBE TV", "Reconnecting WiFi", "Please wait");
    recordRenderFull("status", micros() - renderStartUs);
    wifiReconnectStatusRendered = true;
  }

  if (wifiReconnectAttemptAtMs == 0 || (nowMs - wifiReconnectAttemptAtMs) >= kWifiReconnectRetryMs) {
    wifiReconnectAttemptAtMs = nowMs;
    WiFi.reconnect();
    Serial.printf("wifi_reconnect_attempt status=%d elapsed_ms=%lu\n",
                  static_cast<int>(WiFi.status()),
                  nowMs - wifiDisconnectedAtMs);
  }

  if ((nowMs - wifiDisconnectedAtMs) >= kWifiReconnectFallbackMs) {
    Serial.println("wifi_reconnect_failed action=setup_ap");
    startSetupAccessPoint();
  }
}

